<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b3d797dc99acadb9a512245d0d6898c386a7ceade8992decc1a56adcab99cb09","plan_job_ref":"Job Plan Airflow DAGs #389 at https://github.com/cal-itp/data-infra/actions/runs/16509924972","plan_out_hash":"99ebfec1cb29426a3123d895a40bf027375140de338f9f39e61acc71a66a6a64","plan_hash":"3e99df7131849d1a7ca40bbe8754a246967f58876fa23e63e90dc76c5d6c392e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 17 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "9PIwBw==" -> (known after apply)
!~      detect_md5hash      = "4YveP9A7ljqqjg/3Bgs2fw==" -> "different hash"
!~      generation          = 1753321626951090 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "4YveP9A7ljqqjg/3Bgs2fw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/gtfs_rt_stg_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "VEnQbA==" -> (known after apply)
!~      detect_md5hash      = "mAk7HxroRGKrviDdsObAlw==" -> "different hash"
!~      generation          = 1753321626365545 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
!~      md5hash             = "mAk7HxroRGKrviDdsObAlw==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/gtfs_rt_stg_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "PRMWGQ==" -> (known after apply)
!~      detect_md5hash      = "FI9MAkxi/x0ufm066ibFRg==" -> "different hash"
!~      generation          = 1753321627216699 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
!~      md5hash             = "FI9MAkxi/x0ufm066ibFRg==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_service_alerts_messages_unnested.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "iNQ7Lw==" -> (known after apply)
!~      detect_md5hash      = "L96khzO38KHGV21x4CANiA==" -> "different hash"
!~      generation          = 1749663119023171 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_service_alerts_messages_unnested.sql"
!~      md5hash             = "L96khzO38KHGV21x4CANiA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_service_alerts_messages_unnested.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "nxGQRg==" -> (known after apply)
!~      detect_md5hash      = "NmwXArPgOkEKGFW3APzVvQ==" -> "different hash"
!~      generation          = 1753321626361434 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
!~      md5hash             = "NmwXArPgOkEKGFW3APzVvQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "g7NYyQ==" -> (known after apply)
!~      detect_md5hash      = "Z/pBu7WcX8jnOnNdy+kwQQ==" -> "different hash"
!~      generation          = 1753321627237237 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"
!~      md5hash             = "Z/pBu7WcX8jnOnNdy+kwQQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "k2pIpA==" -> (known after apply)
!~      detect_md5hash      = "P+wEzEYp+eGNL9xaNZJ15Q==" -> "different hash"
!~      generation          = 1753321626349365 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
!~      md5hash             = "P+wEzEYp+eGNL9xaNZJ15Q==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "FSI7Gg==" -> (known after apply)
!~      detect_md5hash      = "t2jouWuZ/qiG0o2U7RPNyw==" -> "different hash"
!~      generation          = 1753321627208184 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"
!~      md5hash             = "t2jouWuZ/qiG0o2U7RPNyw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "01A2bw==" -> (known after apply)
!~      detect_md5hash      = "Wmj2r+w4gDcDGbtYQH5zvw==" -> "different hash"
!~      generation          = 1753321626349813 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
!~      md5hash             = "Wmj2r+w4gDcDGbtYQH5zvw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "5X8EWQ==" -> (known after apply)
!~      detect_md5hash      = "VmV4oTECImaOT3NumJE3sA==" -> "different hash"
!~      generation          = 1753321626962698 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"
!~      md5hash             = "VmV4oTECImaOT3NumJE3sA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "0RKFwQ==" -> (known after apply)
!~      detect_md5hash      = "s3oSLvIOqRwarkYQ3xodsg==" -> "different hash"
!~      generation          = 1753321626365313 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"
!~      md5hash             = "s3oSLvIOqRwarkYQ3xodsg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "R/v19A==" -> (known after apply)
!~      detect_md5hash      = "t80b9rkOYo6YMHOesr+6Pg==" -> "different hash"
!~      generation          = 1753321626356922 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"
!~      md5hash             = "t80b9rkOYo6YMHOesr+6Pg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "urGYUw==" -> (known after apply)
!~      detect_md5hash      = "WZ/uoaPVIWRtDdlm7KpGcw==" -> "different hash"
!~      generation          = 1753321626372419 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"
!~      md5hash             = "WZ/uoaPVIWRtDdlm7KpGcw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "cXrYpw==" -> (known after apply)
!~      detect_md5hash      = "PVTU97NPnlC1qKGY4yFPXQ==" -> "different hash"
!~      generation          = 1753321627198178 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"
!~      md5hash             = "PVTU97NPnlC1qKGY4yFPXQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "Vo5xEg==" -> (known after apply)
!~      detect_md5hash      = "mRPVKhp6BBYvsLvJMBqRIQ==" -> "different hash"
!~      generation          = 1753321627266289 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"
!~      md5hash             = "mRPVKhp6BBYvsLvJMBqRIQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "76sp0w==" -> (known after apply)
!~      detect_md5hash      = "dhvRva3yI+z4zYghRCe6kw==" -> "different hash"
!~      generation          = 1753321626365721 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"
!~      md5hash             = "dhvRva3yI+z4zYghRCe6kw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "I10dVw==" -> (known after apply)
!~      detect_md5hash      = "baiNu7HaXWOnOXrLIggOVw==" -> "different hash"
!~      generation          = 1753321628807708 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "baiNu7HaXWOnOXrLIggOVw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #389](https://github.com/cal-itp/data-infra/actions/runs/16509924972)